Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AddOpening(Autodesk.Revit.DB.IFC.IFCExtrusionData)
Adds an opening to the data.
Remarks:
The opening is stored for retrieval later via GetOpenings().
data:
The opening.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.SetLocalPlacement(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the data to reference an IfcLocalPlacement handle when creating the extrusion.
Side effect: will set ReuseLocalPlacement to true.
localPlacement:
The IfcLocalPlacement handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ExtrusionDirection
The extrusion direction to generate an extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.CustomAxis
The custom extrusion axis to try when generating an extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012